# cfg/LEAF-YOLO/leaf-edge-drone.yaml
# LEAF-YOLO with FPN + CBAM/ECA + DeformableConv (DCN)

nc: 80  # number of classes
depth_multiple: 1.0
width_multiple: 1.0

# anchors are usually dataset-specific (VisDrone example)
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# ------------------------------------------------------------------
# BACKBONE
# ------------------------------------------------------------------
backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],               # 0-P1/2
    [-1, 1, DeformConv, [128, 3, 2]],        # 1-P2/4
    [-1, 3, C3, [128]],                      # 2
    [-1, 1, DeformConv, [256, 3, 2]],        # 3-P3/8
    [-1, 6, C3, [256]],                      # 4
    [-1, 1, DeformConv, [512, 3, 2]],        # 5-P4/16
    [-1, 9, C3, [512]],                      # 6
    [-1, 1, DeformConv, [1024, 3, 2]],       # 7-P5/32
    [-1, 3, C3, [1024]],                     # 8
    [-1, 1, SPPF, [1024, 5]],                # 9
  ]

# ------------------------------------------------------------------
# HEAD (includes FPN Neck + Attention + Detection layers)
# ------------------------------------------------------------------
head:
  [
    # FPN Top-down with attention
    [-1, 1, CBAM, []],                       # 10 attention on P5
    [-1, 1, Conv, [512, 1, 1]],              # 11
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 12
    [6, 1, Conv, [512, 1, 1]],               # 13 from P4 (layer 6)
    [[-1, -2], 1, Concat, [1]],              # 14 cat(P4,P5)
    [-1, 3, C3, [512, False]],               # 15

    [-1, 1, CBAM, []],                       # 16 attention on P4
    [-1, 1, Conv, [256, 1, 1]],              # 17
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 18
    [4, 1, Conv, [256, 1, 1]],               # 19 from P3 (layer 4)
    [[-1, -2], 1, Concat, [1]],              # 20 cat(P3,P4)
    [-1, 3, C3, [256, False]],               # 21 - P3 output
    [-1, 1, ECA, []],                        # 22 - P3 final with ECA

    # FPN Bottom-up
    [-1, 1, Conv, [256, 3, 2]],              # 23 downsample P3
    [[-1, 16], 1, Concat, [1]],              # 24 cat with P4 (layer 16)
    [-1, 3, C3, [512, False]],               # 25 - P4 output
    [-1, 1, CBAM, []],                       # 26 - P4 final with CBAM
    
    [-1, 1, Conv, [512, 3, 2]],              # 27 downsample P4
    [[-1, 10], 1, Concat, [1]],              # 28 cat with P5 (layer 10)
    [-1, 3, C3, [1024, False]],              # 29 - P5 output
    [-1, 1, ECA, []],                        # 30 - P5 final with ECA

    # Detection heads
    [[22, 26, 30], 1, Detect, [nc, anchors]],  # 31 Detect on P3, P4, P5
  ]
